# 导入依赖包

In [1]:
import pandas as pd
import sqlalchemy

# 连接数据库

In [14]:
# 连接 Mysql 数据库:
import pymysql
engine = sqlalchemy.create_engine('mysql+pymysql://root:Forget,88@123.60.31.182:3306/schoolnew')

In [31]:
# 连接 sqlite 数据库:
# sqlite://<nohostname>/<path>
# where <path> is relative:
engine = sqlalchemy.create_engine("sqlite:///db.sqlite3")

# 写入数据库

In [16]:
df = pd.read_csv('./data/user.csv')
df.head(5)

,password,last_login,user_id,user_name,user_type,is_admin,is_active
0,pbkdf2_sha256$216000$vFoB4UcEZho5$Ne6IaU352Y5T...,NaN,18122801,student1,S,0,1
1,pbkdf2_sha256$216000$Fxx95cQh0TbE$rK7aNnARXxud...,NaN,18122802,student2,S,0,1
2,pbkdf2_sha256$216000$VvXmVvzK2E80$vbwauP5zUIE0...,NaN,18122803,student3,S,0,1
3,pbkdf2_sha256$216000$Q9wRiE5mLLNg$vqndqb4rRNuB...,NaN,18122804,student4,S,0,1
4,pbkdf2_sha256$216000$j75m0WWKFw9R$/rx2VJfHkxbz...,NaN,18122805,student5,S,0,1

In [17]:
df.to_sql(
    name = 'user',
    con = engine,
    index = False,
    if_exists = 'append'
)

第一个参数是指定要导入到哪个表中，第二个参数是连接用的，第三个参数是要去掉索引，第四个参数是指如果数据库里已经有某个值了，就 keep both, 这个参数值有几种不同的，比如 "覆盖" 等.

In [18]:
# 批量添加 按照依赖关系顺序
tableMap = [
    {"csv":"college","table":"CollegeTable"},
    {"csv":"student","table":"StudentTable"},
    {"csv":"teacher","table":"TeacherTable"},
    {"csv":"course","table":"CourseTable"},
    {"csv":"open","table":"OpenTable"},
    {"csv":"score","table":"ScoreTable"}
    ]
for tableIndex in tableMap:
   df = pd.read_csv('./data/{0}.csv'.format(tableIndex["csv"]))
   df.to_sql(
        name = tableIndex["csv"]+'table',
        con = engine,
        index = False,
        if_exists = 'append'
    )

# 读取数据表

In [19]:
df = pd.read_sql_table('opentable', engine)
df.head(5)

   id semester course_time course_id teacher_id
0   1   202002      星期一1-2      C016       1002
1   2   202001      星期一2-3      C003       1002
2   3   202001      星期一1-2      C002       1003
3   4   202001      星期三5-6      C002       1004
4   5   202001      星期三5-7      C006       1005

# 执行Sql语句

In [52]:
query = '''
SELECT user_id, college_id from StudentTable where English_class='C'
'''
df = pd.read_sql_query(query, engine)
df

   user_id  college_id
0        5           7

最后一个函数 pd.read_sql (), 它是 read_sql_table () 和 read_sql_query () 的集合，也就说它会根据传入的第一个参数自动判断是 table 还是 query.

In [12]:
query = '''
SELECT user_id, college_id from StudentTable where English_class='C'
'''
df = pd.read_sql(query, engine)
df

    user_id college_id
0  18122805       CL07

# 成绩分析

[参考1](https://me.bdp.cn/share/index.html?shareId=sdo_a577450540c475cf4e7ccc9f1a6760d0)
[参考2](https://www.zhihu.com/question/24398775)

## 成绩参数
- 平均分、最高分、最低分。
- 难度系数：难度系数是反映试题的难易程度的指标，难度系数越大自然考分就越低。难度系数这样来算：L=1—X/W其中，L为难度系数，X为样本平均得分，W为试卷总分。出（考）题（倒）无数的老师谈一点经验，试题的难度系数在0.3-0.7之间比较合适。

In [11]:
# 计算每学期每个开课课程的难度系数、及格人数、及格率、平均分、最高分、最低分
query = '''
SELECT course_id,COUNT(student_id) as student_num,SUM(case when score>=60 then 1 else 0 end) as pass_num,MAX(score) as score_max,MIN(score) as score_min,AVG(score) as score_avg
from OpenTable as O,ScoreTable as S
where S.open_id=O.id and semester=202001
group by course_id
'''
pass_num_table = pd.read_sql_query(query, engine)
pass_num_table

   course_id  student_num  pass_num  score_max  score_min  score_avg
0          2           12         8         91         56  78.333333
1          3           14        11         97         56  82.214286
2          6           10         6         91         56  71.900000
3          7            6         6         81         61  68.500000
4          8           15        10         91         56  74.466667

In [14]:
pass_num_table["pass_rate"]=pass_num_table[["pass_num","student_num"]].apply(lambda x:x["pass_num"]/x["student_num"],axis=1)
pass_num_table["difficulty"]=pass_num_table[["score_avg"]].apply(lambda x:1-x["score_avg"]/100,axis=1)
pass_num_table = pass_num_table.round(2)
pass_num_table

,course_id,student_num,pass_num,score_max,score_min,score_avg,pass_rate,difficulty
0,2,12,8,91,56,78.33,0.67,0.22
1,3,14,11,97,56,82.21,0.79,0.18
2,6,10,6,91,56,71.90,0.60,0.28
3,7,6,6,81,61,68.50,1.00,0.31
4,8,15,10,91,56,74.47,0.67,0.26

## 成绩分布情况

In [3]:
# 计算每学期每个开课课程的成绩分布情况
query = '''
SELECT course_id,COUNT(student_id) as student_num,
SUM(case when score>=90 and score<=100 then 1 else 0 end) as class_A,
SUM(case when score>=80 and score<90 then 1 else 0 end) as class_B,
SUM(case when score>=70 and score<80 then 1 else 0 end) as class_C,
SUM(case when score>=60 and score<70 then 1 else 0 end) as class_D,
SUM(case when score>=0 and score<60 then 1 else 0 end) as class_E
from OpenTable as O,ScoreTable as S
where S.open_id=O.id and semester=202001
group by course_id
'''
score_distribution = pd.read_sql_query(query, engine)
score_distribution

  course_id  student_num  class_A  class_B  class_C  class_D  class_E
0      C002           12        4        4        0        0        4
1      C003           14        4        6        0        0        4
2      C006           10        2        2        1        1        4
3      C007            6        0        2        0        4        0
4      C008           15        3        5        1        1        5

In [8]:
da = score_distribution.to_dict(orient='split')
da

{'index': [0, 1, 2, 3, 4],
 'columns': ['course_id',
  'student_num',
  'class_A',
  'class_B',
  'class_C',
  'class_D',
  'class_E'],
 'data': [['C002', 12, 4, 4, 0, 0, 4],
  ['C003', 14, 4, 6, 0, 0, 4],
  ['C006', 10, 2, 2, 1, 1, 4],
  ['C007', 6, 0, 2, 0, 4, 0],
  ['C008', 15, 3, 5, 1, 1, 5]]}

In [7]:
das = score_distribution.to_json(orient='split')
das

'{"columns":["course_id","student_num","class_A","class_B","class_C","class_D","class_E"],"index":[0,1,2,3,4],"data":[["C002",12,4,4,0,0,4],["C003",14,4,6,0,0,4],["C006",10,2,2,1,1,4],["C007",6,0,2,0,4,0],["C008",15,3,5,1,1,5]]}'

In [10]:
semester='202001'
course_id='2'
query = '''
        SELECT C.*,
        COUNT(student_id) as student_num,
        SUM(case when score>=60 then 1 else 0 end) as pass_num,
        MAX(score) as score_max,MIN(score) as score_min,
        AVG(score) as score_avg
        from OpenTable as O,ScoreTable as S,Coursetable as C
        where S.open_id=O.id and C.course_id=O.course_id and semester={0} and O.course_id={1}
        '''.format(semester,course_id)
pass_num_table = pd.read_sql_query(query, engine)
# pass_num_table["pass_rate"]=pass_num_table[["pass_num","student_num"]].apply(lambda x:x["pass_num"]/x["student_num"],axis=1)
# pass_num_table["difficulty"]=pass_num_table[["score_avg"]].apply(lambda x:1-x["score_avg"]/100,axis=1)
pass_num_table

,course_id,course_name,credit,student_num,pass_num,score_max,score_min,score_avg
0,2,操作系统,5,12,8,91,56,78.333333

# 学生成绩分析

In [20]:
# 学生平均成绩变化
student_id = '18122801'
query = '''
        SELECT O.semester,AVG(score) as avg_score
        FROM ScoreTable as S,OpenTable as O
        where student_id = {0} and O.id = S.open_id
        group by O.semester
        '''.format(student_id)
Avg_table = pd.read_sql_query(query, engine)
Avg_table

  semester  avg_score
0   202002       71.5
1   202001       85.0
2   202004       96.0
3   202003       92.5